physical-computation/Warp-firmware/tools/sdk/ksdk1.1.0/platform/CMSIS/Include/device/MKL03Z4/MKL03Z4_registers.h
/*! @brief Format value for bitfield SIM_COPC_COPT. */
#define BF_SIM_COPC_COPT(v)  ((uint32_t)((uint32_t)(v) << BP_SIM_COPC_COPT) & BM_SIM_COPC_COPT)

/*! @brief Set the COPT field to a new value. */
#define BW_SIM_COPC_COPT(x, v) (BME_BFI32(HW_SIM_COPC_ADDR(x), ((uint32_t)(v) << BP_SIM_COPC_COPT), BP_SIM_COPC_COPT, 2))
/*@}*/

/*!
 * @name Register SIM_COPC, field COPSTPEN[4] (RW)
 *
 * Values:
 * - 0 - COP is disabled and the counter is reset in Stop modes
 * - 1 - COP is enabled in Stop modes
 */
/*@{*/
#define BP_SIM_COPC_COPSTPEN (4U)          /*!< Bit position for SIM_COPC_COPSTPEN. */
#define BM_SIM_COPC_COPSTPEN (0x00000010U) /*!< Bit mask for SIM_COPC_COPSTPEN. */
#define BS_SIM_COPC_COPSTPEN (1U)          /*!< Bit field size in bits for SIM_COPC_COPSTPEN. */

/*! @brief Read current value of the SIM_COPC_COPSTPEN field. */
#define BR_SIM_COPC_COPSTPEN(x) (BME_UBFX32(HW_SIM_COPC_ADDR(x), BP_SIM_COPC_COPSTPEN, BS_SIM_COPC_COPSTPEN))

/*! @brief Format value for bitfield SIM_COPC_COPSTPEN. */
#define BF_SIM_COPC_COPSTPEN(v) ((uint32_t)((uint32_t)(v) << BP_SIM_COPC_COPSTPEN) & BM_SIM_COPC_COPSTPEN)

/*! @brief Set the COPSTPEN field to a new value. */
#define BW_SIM_COPC_COPSTPEN(x, v) (BME_BFI32(HW_SIM_COPC_ADDR(x), ((uint32_t)(v) << BP_SIM_COPC_COPSTPEN), BP_SIM_COPC_COPSTPEN, 1))
/*@}*/

/*!
 * @name Register SIM_COPC, field COPDBGEN[5] (RW)
 *
 * Values:
 * - 0 - COP is disabled and the counter is reset in Debug mode
 * - 1 - COP is enabled in Debug mode
 */
/*@{*/
#define BP_SIM_COPC_COPDBGEN (5U)          /*!< Bit position for SIM_COPC_COPDBGEN. */
#define BM_SIM_COPC_COPDBGEN (0x00000020U) /*!< Bit mask for SIM_COPC_COPDBGEN. */
#define BS_SIM_COPC_COPDBGEN (1U)          /*!< Bit field size in bits for SIM_COPC_COPDBGEN. */

/*! @brief Read current value of the SIM_COPC_COPDBGEN field. */
#define BR_SIM_COPC_COPDBGEN(x) (BME_UBFX32(HW_SIM_COPC_ADDR(x), BP_SIM_COPC_COPDBGEN, BS_SIM_COPC_COPDBGEN))

/*! @brief Format value for bitfield SIM_COPC_COPDBGEN. */
#define BF_SIM_COPC_COPDBGEN(v) ((uint32_t)((uint32_t)(v) << BP_SIM_COPC_COPDBGEN) & BM_SIM_COPC_COPDBGEN)

/*! @brief Set the COPDBGEN field to a new value. */
#define BW_SIM_COPC_COPDBGEN(x, v) (BME_BFI32(HW_SIM_COPC_ADDR(x), ((uint32_t)(v) << BP_SIM_COPC_COPDBGEN), BP_SIM_COPC_COPDBGEN, 1))
/*@}*/

/*!
 * @name Register SIM_COPC, field COPCLKSEL[7:6] (RW)
 *
 * This write-once field selects the clock source of the COP watchdog.
 *
 * Values:
 * - 00 - LPO clock (1 kHz)
 * - 01 - MCGIRCLK
 * - 10 - OSCERCLK
 * - 11 - Bus clock
 */
/*@{*/
#define BP_SIM_COPC_COPCLKSEL (6U)         /*!< Bit position for SIM_COPC_COPCLKSEL. */
#define BM_SIM_COPC_COPCLKSEL (0x000000C0U) /*!< Bit mask for SIM_COPC_COPCLKSEL. */
#define BS_SIM_COPC_COPCLKSEL (2U)         /*!< Bit field size in bits for SIM_COPC_COPCLKSEL. */

/*! @brief Read current value of the SIM_COPC_COPCLKSEL field. */
#define BR_SIM_COPC_COPCLKSEL(x) (BME_UBFX32(HW_SIM_COPC_ADDR(x), BP_SIM_COPC_COPCLKSEL, BS_SIM_COPC_COPCLKSEL))

/*! @brief Format value for bitfield SIM_COPC_COPCLKSEL. */
#define BF_SIM_COPC_COPCLKSEL(v) ((uint32_t)((uint32_t)(v) << BP_SIM_COPC_COPCLKSEL) & BM_SIM_COPC_COPCLKSEL)

/*! @brief Set the COPCLKSEL field to a new value. */
#define BW_SIM_COPC_COPCLKSEL(x, v) (BME_BFI32(HW_SIM_COPC_ADDR(x), ((uint32_t)(v) << BP_SIM_COPC_COPCLKSEL), BP_SIM_COPC_COPCLKSEL, 2))
/*@}*/

/*******************************************************************************
 * HW_SIM_SRVCOP - Service COP
 ******************************************************************************/

/*!
 * @brief HW_SIM_SRVCOP - Service COP (WO)
 *
 * Reset value: 0x00000000U
 *
 * This is write only register, any read to this register will cause transfer
 * error.
 */
typedef union _hw_sim_srvcop
{
    uint32_t U;
    struct _hw_sim_srvcop_bitfields
    {
        uint32_t SRVCOP : 8;           /*!< [7:0] Service COP Register */
        uint32_t RESERVED0 : 24;       /*!< [31:8]  */
    } B;
} hw_sim_srvcop_t;

/*!
 * @name Constants and macros for entire SIM_SRVCOP register
 */
/*@{*/
#define HW_SIM_SRVCOP_ADDR(x)    ((uint32_t)(x) + 0x1104U)

#define HW_SIM_SRVCOP(x)         (*(__O hw_sim_srvcop_t *) HW_SIM_SRVCOP_ADDR(x))
#define HW_SIM_SRVCOP_WR(x, v)   (HW_SIM_SRVCOP(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual SIM_SRVCOP bitfields
 */

/*!
 * @name Register SIM_SRVCOP, field SRVCOP[7:0] (WO)
 *
 * Write 0x55 and then 0xAA (in that order) to reset the COP timeout counter,
 * writing any other value will generate a system reset.
 */
/*@{*/
#define BP_SIM_SRVCOP_SRVCOP (0U)          /*!< Bit position for SIM_SRVCOP_SRVCOP. */
#define BM_SIM_SRVCOP_SRVCOP (0x000000FFU) /*!< Bit mask for SIM_SRVCOP_SRVCOP. */
#define BS_SIM_SRVCOP_SRVCOP (8U)          /*!< Bit field size in bits for SIM_SRVCOP_SRVCOP. */

/*! @brief Format value for bitfield SIM_SRVCOP_SRVCOP. */
#define BF_SIM_SRVCOP_SRVCOP(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SRVCOP_SRVCOP) & BM_SIM_SRVCOP_SRVCOP)
/*@}*/

/*******************************************************************************
 * hw_sim_t - module struct
 ******************************************************************************/
/*!
 * @brief All SIM module registers.
 */
#pragma pack(1)
typedef struct _hw_sim
{
    __IO hw_sim_sopt1_t SOPT1;             /*!< [0x0] System Options Register 1 */
    uint8_t _reserved0[4096];
    __IO hw_sim_sopt2_t SOPT2;             /*!< [0x1004] System Options Register 2 */
    uint8_t _reserved1[4];
    __IO hw_sim_sopt4_t SOPT4;             /*!< [0x100C] System Options Register 4 */
    __IO hw_sim_sopt5_t SOPT5;             /*!< [0x1010] System Options Register 5 */
    uint8_t _reserved2[4];
    __IO hw_sim_sopt7_t SOPT7;             /*!< [0x1018] System Options Register 7 */
    uint8_t _reserved3[8];
    __I hw_sim_sdid_t SDID;                /*!< [0x1024] System Device Identification Register */
    uint8_t _reserved4[12];
    __IO hw_sim_scgc4_t SCGC4;             /*!< [0x1034] System Clock Gating Control Register 4 */
    __IO hw_sim_scgc5_t SCGC5;             /*!< [0x1038] System Clock Gating Control Register 5 */
    __IO hw_sim_scgc6_t SCGC6;             /*!< [0x103C] System Clock Gating Control Register 6 */
    uint8_t _reserved5[4];
    __IO hw_sim_clkdiv1_t CLKDIV1;         /*!< [0x1044] System Clock Divider Register 1 */
    uint8_t _reserved6[4];
    __IO hw_sim_fcfg1_t FCFG1;             /*!< [0x104C] Flash Configuration Register 1 */
    __I hw_sim_fcfg2_t FCFG2;              /*!< [0x1050] Flash Configuration Register 2 */
    uint8_t _reserved7[4];
    __I hw_sim_uidmh_t UIDMH;              /*!< [0x1058] Unique Identification Register Mid-High */
    __I hw_sim_uidml_t UIDML;              /*!< [0x105C] Unique Identification Register Mid Low */
    __I hw_sim_uidl_t UIDL;                /*!< [0x1060] Unique Identification Register Low */
    uint8_t _reserved8[156];
    __IO hw_sim_copc_t COPC;               /*!< [0x1100] COP Control Register */
    __O hw_sim_srvcop_t SRVCOP;            /*!< [0x1104] Service COP */
} hw_sim_t;
#pragma pack()

/*! @brief Macro to access all SIM registers. */
/*! @param x SIM module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_SIM_REGS(SIM_BASE)</code>. */
#define HW_SIM_REGS(x) (*(hw_sim_t *)(x))

