physical-computation/Warp-firmware/tools/sdk/ksdk1.1.0/platform/CMSIS/Include/device/MKL03Z4/MKL03Z4_registers.h
/*! @brief Format value for bitfield SPI_C1_SPIE. */
#define BF_SPI_C1_SPIE(v)    ((uint8_t)((uint8_t)(v) << BP_SPI_C1_SPIE) & BM_SPI_C1_SPIE)

/*! @brief Set the SPIE field to a new value. */
#define BW_SPI_C1_SPIE(x, v) (BME_BFI8(HW_SPI_C1_ADDR(x), ((uint8_t)(v) << BP_SPI_C1_SPIE), BP_SPI_C1_SPIE, 1))
/*@}*/

/*******************************************************************************
 * HW_SPI_M - SPI Match Register
 ******************************************************************************/

/*!
 * @brief HW_SPI_M - SPI Match Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains the hardware compare value. When the value received in
 * the SPI receive data buffer equals this hardware compare value, the SPI Match
 * Flag in the S register (S[SPMF]) sets.
 */
typedef union _hw_spi_m
{
    uint8_t U;
    struct _hw_spi_m_bitfields
    {
        uint8_t Bits : 8;              /*!< [7:0] Hardware compare value (low byte) */
    } B;
} hw_spi_m_t;

/*!
 * @name Constants and macros for entire SPI_M register
 */
/*@{*/
#define HW_SPI_M_ADDR(x)         ((uint32_t)(x) + 0x4U)

#define HW_SPI_M(x)              (*(__IO hw_spi_m_t *) HW_SPI_M_ADDR(x))
#define HW_SPI_M_RD(x)           (HW_SPI_M(x).U)
#define HW_SPI_M_WR(x, v)        (HW_SPI_M(x).U = (v))
#define HW_SPI_M_SET(x, v)       (BME_OR8(HW_SPI_M_ADDR(x), (uint8_t)(v)))
#define HW_SPI_M_CLR(x, v)       (BME_AND8(HW_SPI_M_ADDR(x), (uint8_t)(~(v))))
#define HW_SPI_M_TOG(x, v)       (BME_XOR8(HW_SPI_M_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SPI_M bitfields
 */

/*!
 * @name Register SPI_M, field Bits[7:0] (RW)
 */
/*@{*/
#define BP_SPI_M_Bits        (0U)          /*!< Bit position for SPI_M_Bits. */
#define BM_SPI_M_Bits        (0xFFU)       /*!< Bit mask for SPI_M_Bits. */
#define BS_SPI_M_Bits        (8U)          /*!< Bit field size in bits for SPI_M_Bits. */

/*! @brief Read current value of the SPI_M_Bits field. */
#define BR_SPI_M_Bits(x)     (HW_SPI_M(x).U)

/*! @brief Format value for bitfield SPI_M_Bits. */
#define BF_SPI_M_Bits(v)     ((uint8_t)((uint8_t)(v) << BP_SPI_M_Bits) & BM_SPI_M_Bits)

/*! @brief Set the Bits field to a new value. */
#define BW_SPI_M_Bits(x, v)  (HW_SPI_M_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_SPI_D - SPI Data Register
 ******************************************************************************/

/*!
 * @brief HW_SPI_D - SPI Data Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register is both the input and output register for SPI data. A write to
 * the register writes to the transmit data buffer, allowing data to be queued
 * and transmitted. When the SPI is configured as a master, data queued in the
 * transmit data buffer is transmitted immediately after the previous transmission
 * has completed. The SPTEF bit in the S register indicates when the transmit data
 * buffer is ready to accept new data. The S register must be read when S[SPTEF]
 * is set before writing to the SPI data register; otherwise, the write is
 * ignored. Data may be read from the SPI data register any time after S[SPRF] is set
 * and before another transfer is finished. Failure to read the data out of the
 * receive data buffer before a new transfer ends causes a receive overrun
 * condition, and the data from the new transfer is lost. The new data is lost because
 * the receive buffer still held the previous character and was not ready to accept
 * the new data. There is no indication for a receive overrun condition, so the
 * application system designer must ensure that previous data has been read from
 * the receive buffer before a new transfer is initiated.
 */
typedef union _hw_spi_d
{
    uint8_t U;
    struct _hw_spi_d_bitfields
    {
        uint8_t Bits : 8;              /*!< [7:0] Data (low byte) */
    } B;
} hw_spi_d_t;

/*!
 * @name Constants and macros for entire SPI_D register
 */
/*@{*/
#define HW_SPI_D_ADDR(x)         ((uint32_t)(x) + 0x6U)

#define HW_SPI_D(x)              (*(__IO hw_spi_d_t *) HW_SPI_D_ADDR(x))
#define HW_SPI_D_RD(x)           (HW_SPI_D(x).U)
#define HW_SPI_D_WR(x, v)        (HW_SPI_D(x).U = (v))
#define HW_SPI_D_SET(x, v)       (BME_OR8(HW_SPI_D_ADDR(x), (uint8_t)(v)))
#define HW_SPI_D_CLR(x, v)       (BME_AND8(HW_SPI_D_ADDR(x), (uint8_t)(~(v))))
#define HW_SPI_D_TOG(x, v)       (BME_XOR8(HW_SPI_D_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SPI_D bitfields
 */

/*!
 * @name Register SPI_D, field Bits[7:0] (RW)
 */
/*@{*/
#define BP_SPI_D_Bits        (0U)          /*!< Bit position for SPI_D_Bits. */
#define BM_SPI_D_Bits        (0xFFU)       /*!< Bit mask for SPI_D_Bits. */
#define BS_SPI_D_Bits        (8U)          /*!< Bit field size in bits for SPI_D_Bits. */

/*! @brief Read current value of the SPI_D_Bits field. */
#define BR_SPI_D_Bits(x)     (HW_SPI_D(x).U)

/*! @brief Format value for bitfield SPI_D_Bits. */
#define BF_SPI_D_Bits(v)     ((uint8_t)((uint8_t)(v) << BP_SPI_D_Bits) & BM_SPI_D_Bits)

/*! @brief Set the Bits field to a new value. */
#define BW_SPI_D_Bits(x, v)  (HW_SPI_D_WR(x, v))
/*@}*/

/*******************************************************************************
 * hw_spi_t - module struct
 ******************************************************************************/
/*!
 * @brief All SPI module registers.
 */
#pragma pack(1)
typedef struct _hw_spi
{
    __I hw_spi_s_t S;                      /*!< [0x0] SPI Status Register */
    __IO hw_spi_br_t BR;                   /*!< [0x1] SPI Baud Rate Register */
    __IO hw_spi_c2_t C2;                   /*!< [0x2] SPI Control Register 2 */
    __IO hw_spi_c1_t C1;                   /*!< [0x3] SPI Control Register 1 */
    __IO hw_spi_m_t M;                     /*!< [0x4] SPI Match Register */
    uint8_t _reserved0[1];
    __IO hw_spi_d_t D;                     /*!< [0x6] SPI Data Register */
} hw_spi_t;
#pragma pack()

/*! @brief Macro to access all SPI registers. */
/*! @param x SPI module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_SPI_REGS(SPI0_BASE)</code>. */
#define HW_SPI_REGS(x) (*(hw_spi_t *)(x))

